app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(article_params)
    @article.user = current_user
    if @article.save
---
INSERT INTO "articles" ("title", "description") VALUES (?, ?)  [["title", "fsfsdfsdf"], ["description", "dfsdfsdfsdfsdf"]]

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = ? WHERE "articles"."id" = ?  [["title", "ssjdhajsdh"], ["id", 7]]